Catalogs/ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ШаблоныСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОснования</Name>
					<Comment>Для дополнительного разделения оснований (ЗаказПокупателя/Заказ-наряд)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкиТекстаHTML</Name>
					<Comment>Структура картинок форматированного документа</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКаналовСвязи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыКаналовСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыКаналовСвязи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Email</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ШаблоныСообщений/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("СпособОтправки") Тогда
		
		АвтоЗаголовок = Ложь;
		Заголовок = Метаданные.Справочники.ШаблоныСообщений.Представление() + " "  + Строка(Параметры.Отбор.СпособОтправки);
		
		Элементы.ФормаСоздатьШаблонEmail.Видимость	= Параметры.Отбор.СпособОтправки = Перечисления.ВидыКаналовСвязи.Email;
		Элементы.ФормаСоздатьШаблонSMS.Видимость	= Параметры.Отбор.СпособОтправки = Перечисления.ВидыКаналовСвязи.SMS;
		
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ПолноеИмяОснования") И ЗначениеЗаполнено(Параметры.Отбор.ПолноеИмяОснования) Тогда
		
		ПолноеИмяОснования = Параметры.Отбор.ПолноеИмяОснования;
		
		Если Параметры.Отбор.Свойство("ВидОснования") Тогда
			ВидОснования = Параметры.Отбор.ВидОснования;
		КонецЕсли;
		
		МетаданныеОснования = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОснования);
		Если МетаданныеОснования <> Неопределено Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = Заголовок + " " + НСтр("ru='по основанию:';uk='по підставі:'") + " ";
			Если Параметры.Отбор.Свойство("ВидОснования") И Параметры.Отбор.ВидОснования = "ЗаказНаряд" Тогда
				Заголовок = Заголовок + НСтр("ru='Заказ-наряд';uk='Замовлення-наряд'");
			Иначе
				Заголовок = Заголовок + МетаданныеОснования.Представление();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Установим настройки формы для случая открытия в режиме выбора
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	Элементы.Список.МножественныйВыбор = ?(Параметры.ЗакрыватьПриВыборе = Неопределено, Ложь, Не Параметры.ЗакрыватьПриВыборе);
	Если Параметры.РежимВыбора Тогда
		КлючНазначенияИспользования = "ВыборПодбор";
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	Иначе
		КлючНазначенияИспользования = "Список";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьШаблонEmail(Команда)
	
	СоздатьШаблон(ПредопределенноеЗначение("Перечисление.ВидыКаналовСвязи.Email"));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьШаблонSMS(Команда)
	
	СоздатьШаблон(ПредопределенноеЗначение("Перечисление.ВидыКаналовСвязи.SMS"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьШаблон(СпособОтправки)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("СпособОтправки", СпособОтправки);
	Если Не ПустаяСтрока(ПолноеИмяОснования) Тогда
		ЗначенияЗаполнения.Вставить("ПолноеИмяОснования", ПолноеИмяОснования);
	КонецЕсли;
	Если Не ПустаяСтрока(ВидОснования) Тогда
		ЗначенияЗаполнения.Вставить("ВидОснования", ВидОснования);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Справочник.ШаблоныСообщений.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
